content/projects/ludum-dare-44.md
---
layout: game
title: ALIEN, e x p a n s i o n .
icon: game/favicon.png
icon_mode: pixelated
icon_type: normal
placeholder: game/placeholder.png
landscape: nil
game: game/index.js
ludum_dare: 44/alien-e-x-p-a-n-s-i-o-n
lang: pico
---


<a id="org43875e2"></a>

# Instructions

Play as an alien bounty hunter attempting to amass a small fortune by capturing human manned ships using a state-of-the-art vortex laser.

You will be payed by some of the galaxies top scientists who aim to study these humans.

Be careful as hitting human ships will deplete your life meter and more importantly will lead to unwarranted attention and hence will detract from your score/pay.

However capturing a human will restore a small amount of life and the increase your score.  Additionally flying past human ships will also add to your score.

Capture as many ships as possible to achieve a high payday and satisfy the scientists.


<a id="org4260b09"></a>

## Controls

-   **Arrows Keys** - Control your ship
-   **X Key** - Fire vortex laser / Advance menus
-   **Z Key** - Change camera settings (menu)


<a id="org244d89a"></a>

## About

Small game created in under 48 hours for [Ludum Dare 44](https://ldjam.com/events/ludum-dare/44) with the theme of **Your life is currency**.

Game is built using [Lua](https://www.lua.org/) and [MoonScript](https://moonscript.org/), with the [PICO-8](https://www.lexaloffle.com/pico-8.php) Fantasy Console.

Entered as a [Ludum Dare 44](https://ldjam.com/events/ludum-dare/44) **compo** game.
